export default function About() {
  return (
    <main dir="rtl">
      <h1 className="res-text">درباره من</h1>
      <p className="res-text text-lg">سلام! من یک توسعه‌دهنده نرم‌افزار هستم با بیش از چهار سال تجربه در دنیای برنامه‌نویسی و توسعه‌ی وب. از همان ابتدای مسیر، به تکنولوژی و ساخت نرم‌افزار علاقه‌مند بودم و به مرور زمان با زبان‌ها و ابزارهای مختلفی کار کردم. در طول این سال‌ها با زبان‌های برنامه‌نویسی C++‎، Java، Python، JavaScript، Node.js و C# تجربه‌ی عملی داشته‌ام. در حوزه‌ی توسعه وب نیز با فریم‌ورک‌های مدرن مانند Next.js، React، Nest.js و GraphQL کار کرده‌ام و پروژه‌های مختلفی را در زمینه‌ی طراحی و پیاده‌سازی اپلیکیشن‌های تحت وب انجام داده‌ام. علاقه من تنها به وب محدود نمی‌شود؛ در زمینه‌ی برنامه‌نویسی اندروید با React Native نیز تجربه دارم و چندین پروژه موبایل را توسعه داده‌ام. همچنین سابقه‌ی ساخت ربات‌های تلگرام با قابلیت‌های متنوع را دارم که باعث شد مهارت خوبی در کار با APIها و مدیریت داده‌ها پیدا کنم. در کنار این‌ها، به دنیای گرافیک و برنامه‌نویسی سه‌بعدی هم علاقه‌مندم و با OpenGL کار کرده‌ام؛ تجربه‌ای که دید عمیق‌تری به من در زمینه‌ی پردازش گرافیکی و رندرینگ داده است. برای من، یادگیری هیچ‌وقت متوقف نمی‌شود. همیشه سعی کرده‌ام در پروژه‌هایم از تکنولوژی‌های به‌روز استفاده کنم و همزمان دانشم را ارتقا بدهم. هدفم این است که نرم‌افزارهایی طراحی کنم که هم کاربردی باشند، هم زیبا و کاربرپسند.</p>
    </main>
  )
}